Revit 2027 API
PanelScheduleView.IsRowInCircuitTable Method
 Check if this row in the circuit table
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRowInCircuitTable(
	int nRow
)
Public Function IsRowInCircuitTable (
	nRow As Integer
) As Boolean
public:
bool IsRowInCircuitTable(
	int nRow
)
member IsRowInCircuitTable :
        nRow : int -> bool
Parameters
nRow Int32
 Row Number
Return Value
Boolean
 True if this row in the circuit table, false otherwise.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace